tutorials/surfaceTracking/interTrackFoam/ramp/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-4 0 0)
    ( 0 0 0)
    ( 0 1 0)
    (-4 1 0)

    (-4 0 0.1)
    ( 0 0 0.1)
    ( 0 1 0.1)
    (-4 1 0.1)

    (1 0.2 0)
    (1 1 0)

    (1 0.2 0.1)
    (1 1 0.1)

    (5 0.2 0)
    (5 1 0)

    (5 0.2 0.1)
    (5 1 0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 1) simpleGrading (0.3 1 1)
    hex (1 8 9 2 5 10 11 6) (10 10 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (20 10 1) simpleGrading (3.33 1 1)
);

edges
(
);

boundary
(
    freeSurface
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 11 9)
            (9 11 15 13)
        );
    }

    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (12 13 15 14)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (5 4 0 1)
            (10 5 1 8)
            (14 10 8 12)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
            (8 9 13 12)
            (10 14 15 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
